Belief997/lab-Micro_power_consumption_backscatter/SDK_2.3.1_MKL03Z32xxx4/boards/frdmkl03z/demo_apps/power_mode_switch/power_mode_switch.c
    }

//    GPIO_PortToggle(GPIOA, 1u << 5U);
//    GPIO_PortToggle(GPIOB, 1u << 3U);
    /* Set conversionCompleted flag. This prevents an wrong conversion in main function */
    conversionCompleted = true;
/* Add for ARM errata 838869, affects Cortex-M4, Cortex-M4F Store immediate overlapping
  exception return operation might vector to incorrect interrupt */
#if defined __CORTEX_M && (__CORTEX_M == 4U)
    __DSB();
#endif
}


/*!
 * @brief main function
 */

#define DEMO_LPTMR_IRQn LPTMR0_IRQn
#define LPTMR_LED_HANDLER LPTMR0_IRQHandler
volatile u8 dataBuf[SENSOR_DATA_LEN];

volatile u8 status = STATUS_WAIT_TRIG;
volatile u8 status_rec = REC_WAIT;
volatile u8 status_send = SEND_WAIT;

volatile u32 cntBit = 0;
volatile u8 cntByte = 0;
volatile u8 iovalue = 0;

static u8 fskBuff[2*FSK_FRAME_LEN] = {0};
u8 fskLen = 0;
void LPTMR0_IRQHandler(void)
{
    LPTMR_ClearStatusFlags(DEMO_LPTMR_BASE, kLPTMR_TimerCompareFlag);

    // debug
//    GPIO_PortToggle(GPIOB, 1u << 3U);

//    // debug
//	{
//
//	    u32 dataBuff[10] = {0x00,0xaaaaaaaa,0xaac194c1, 0xfb86ba5a,0xb3000000};
////		u32 dataBuff[3] = {0xaaaaaaaa,0xaac32987, 0xec765400};
////		u32 tempMask = 0x80000000 >> cntBit;
//		u32 tempvalue = dataBuff[cntByte] >> (31 - cntBit);
////		u8  iovalue = dataBuff[cntByte] & tempMask;
//
//		iovalue = tempvalue & 0x01;
////		GPIO_PinWrite(GPIOB, 3U, iovalue);
//
//		cntByte = (cntBit == (sizeof(dataBuff[0]) * 8 - 1))? (cntByte + 1) % (sizeof(dataBuff)/sizeof(dataBuff[0])) : cntByte;
//		cntBit =  (cntBit + 1) % (sizeof(dataBuff[0]) * 8);
//	}

    // debug


//    u8 *pdata = fskBuff;
//
//    memset(pdata, FSK_PREAMBLE, FSK_PREAMBLE_LEN);
//    pdata += FSK_PREAMBLE_LEN;
//
//    u32 temp = FSK_SYNC_WORD;
//    memcpy(pdata, &temp, FSK_SYNC_LEN);
//    pdata += FSK_SYNC_LEN;
//
//	u8 dataBuff[2][FSK_PAYPLOAD_LEN + 1 + FSK_CRC_LEN] = {FSK_PAYPLOAD_LEN, 0x01,0x02,0x03, 0x04,0x05,0x06};
////	memcpy(pdata, dataBuff, FSK_PAYPLOAD_LEN+1);
////	pdata += FSK_PAYPLOAD_LEN + 1;
//
//	temp = n2s16(CRC_calc(dataBuff, FSK_PAYPLOAD_LEN + 1));
//	memcpy(&dataBuff[0][0]+FSK_PAYPLOAD_LEN + 1, &temp, FSK_CRC_LEN);
//	user_whitening(dataBuff[0], FSK_PAYPLOAD_LEN + 1 + FSK_CRC_LEN, dataBuff[1]);
//	memcpy(pdata, dataBuff[1], FSK_PAYPLOAD_LEN + 1 + FSK_CRC_LEN);

//	pdata += FSK_CRC_LEN;

//		u32 dataBuff[3] = {0xaaaaaaaa,0xaac32987, 0xec765400};
//		u32 tempMask = 0x80000000 >> cntBit;

    u8 *pdata = fskBuff;
	u32 tempvalue = pdata[cntByte] >> (7 - cntBit);
//		u8  iovalue = dataBuff[cntByte] & tempMask;

	iovalue = tempvalue & 0x01;
//	GPIO_PinWrite(GPIOB, 3U, iovalue);

	cntByte = (cntBit == (sizeof(pdata[0]) * 8 - 1))? (cntByte + 1) % (fskLen + 5) : cntByte;
	cntBit =  (cntBit + 1) % (sizeof(pdata[0]) * 8);








#if 0
//    char debug_buf[6]={0x1, 0x2, 0x3, 0x4, 0x5, 0x6};
    if(STATUS_WAIT_SEND == status)
    {
    	static u8 cnt_bit = 0;
    	static u8 cnt_byte = 0;
    	static u8 checkSum = 0;
    	static u8 islastBit = FALSE;

    	do{
			if(islastBit)
			{
				islastBit = FALSE;
				GPIO_PinWrite(GPIOB, 3U, 0);
				status_send = SEND_SUCCESS;
				break;
			}

			if(cnt_byte < SENSOR_HEADER_LEN)
			{
				GPIO_PinWrite(GPIOB, 3U, SENSOR_HEADER & (0x80 >> cnt_bit));
				checkSum = 0;
			}
			else if(cnt_byte < SENSOR_HEADER_LEN + SENSOR_DATA_LEN)
			{
	    		GPIO_PinWrite(GPIOB, 3U, dataBuf[cnt_byte - SENSOR_HEADER_LEN] & (0x80 >> cnt_bit));
//				GPIO_PinWrite(GPIOB, 3U, debug_buf[cnt_byte - SENSOR_HEADER_LEN] & (0x80 >> cnt_bit));
				if(!cnt_bit)
				{
	    			checkSum += dataBuf[cnt_byte - SENSOR_HEADER_LEN];
//					checkSum += debug_buf[cnt_byte - SENSOR_HEADER_LEN];
				}
			}
			else
			{
				GPIO_PinWrite(GPIOB, 3U, checkSum & (0x80 >> cnt_bit));
			}

			cnt_byte = (cnt_bit == 7)? (cnt_byte + 1) % SENSOR_FRAME_LEN : cnt_byte;
			cnt_bit =  (cnt_bit + 1) % 8;

			if(0 == cnt_bit && 0 == cnt_byte)
			{
				islastBit = TRUE;
			}
			else
			{
				status_send = SEND_WAIT;
			}
			break;
    	}while(1);
    }

#endif




    /*
     * Workaround for TWR-KV58: because write buffer is enabled, adding
     * memory barrier instructions to make sure clearing interrupt flag completed
     * before go out ISR
     */
    __DSB();
    __ISB();
}


lpuart_handle_t g_lpuartHandle;
uint8_t g_tipString[] = "LPUART RX ring buffer example\r\nSend back received data\r\nEcho every 8 types\r\n";
uint8_t g_rxRingBuffer[RX_RING_BUFFER_SIZE] = {0}; /* RX ring buffer. */

extern uint8_t g_rxBuffer[ECHO_BUFFER_SIZE]; /* Buffer for receive data to echo. */
extern uint8_t g_txBuffer[ECHO_BUFFER_SIZE]; /* Buffer for send data to echo. */
extern volatile bool rxBufferEmpty;
extern volatile bool txBufferFull;
extern volatile bool txOnGoing;
extern volatile bool rxOnGoing;


#define USER_PWM_NUM  1
#define WAKEUP_ENABLE 0

#include "string.h"
void user_showFreq(void)
{
//	PRINTF("\r\n--------------------------\r\n");
//    PRINTF("kCLOCK_CoreSysClk %d.\r\n", CLOCK_GetFreq(kCLOCK_CoreSysClk));
//    PRINTF("kCLOCK_PlatClk %d.\r\n", CLOCK_GetFreq(kCLOCK_PlatClk));
//    PRINTF("kCLOCK_BusClk %d.\r\n", CLOCK_GetFreq(kCLOCK_BusClk));
//    PRINTF("kCLOCK_FlashClk %d.\r\n", CLOCK_GetFreq(kCLOCK_FlashClk));
//    PRINTF("kCLOCK_Er32kClk %d.\r\n", CLOCK_GetFreq(kCLOCK_Er32kClk));
//    PRINTF("kCLOCK_Osc0ErClk %d.\r\n", CLOCK_GetFreq(kCLOCK_Osc0ErClk));
//    PRINTF("kCLOCK_McgInternalRefClk %d.\r\n", CLOCK_GetFreq(kCLOCK_McgInternalRefClk));
//    PRINTF("kCLOCK_McgPeriphClk %d.\r\n", CLOCK_GetFreq(kCLOCK_McgPeriphClk));
//    PRINTF("kCLOCK_McgIrc48MClk %d.\r\n", CLOCK_GetFreq(kCLOCK_McgIrc48MClk));
//    PRINTF("kCLOCK_LpoClk %d.\r\n", CLOCK_GetFreq(kCLOCK_LpoClk));


	// 2M kCLOCK_CoreSysClk
	// 2M kCLOCK_McgInternalRefClk
	// 0  kCLOCK_McgPeriphClk
    u32 freq = CLOCK_GetFreq(kCLOCK_CoreSysClk);
    char buf[32] = "\0";

    sprintf(buf, "%d\n", freq);


    /* Send g_tipString out. */
    lpuart_transfer_t xfer;
    xfer.data = buf;
    xfer.dataSize = strlen(buf);
    txOnGoing = true;
    LPUART_TransferSendNonBlocking(DEMO_LPUART, &g_lpuartHandle, &xfer);

