Belief997/lab-Micro_power_consumption_backscatter/SDK_2.3.1_MKL03Z32xxx4/boards/frdmkl03z/demo_apps/power_mode_switch/power_mode_switch.c
    /* Wait send finished */
    while (txOnGoing)
    {
    }

}


void user_timerInit(void)
{
	lptmr_config_t lptmrUserConfig;

	LPTMR_GetDefaultConfig(&lptmrUserConfig);
	/* Init LPTimer driver */
	LPTMR_Init(DEMO_LPTMR_BASE, &lptmrUserConfig);

	/* Set the LPTimer period */
	LPTMR_SetTimerPeriod(DEMO_LPTMR_BASE, LPTMR_COMPARE_VALUE);

	/* Enable timer interrupt */
	LPTMR_EnableInterrupts(DEMO_LPTMR_BASE, kLPTMR_TimerInterruptEnable);

	/* Enable at the NVIC */
	EnableIRQ(DEMO_LPTMR_IRQn);
	LPTMR_StartTimer(DEMO_LPTMR_BASE);
}
void user_pwmInit(void)
{
	#ifndef TPM_LED_ON_LEVEL

	#define TPM_LED_ON_LEVEL kTPM_LowTrue
	#endif
	#if USER_PWM_NUM == 1
		tpm_config_t tpmInfo;
		tpm_chnl_pwm_signal_param_t tpmParam;

		tpmParam.chnlNumber = (tpm_chnl_t)BOARD_TPM_CHANNEL;
		tpmParam.level = TPM_LED_ON_LEVEL;
		tpmParam.dutyCyclePercent = updatedDutycycle;

	#elif USER_PWM_NUM == 2
		tpm_config_t tpmInfo;
		tpm_chnl_pwm_signal_param_t tpmParam[2];

	#ifndef TPM_LED_ON_LEVEL
		  #define TPM_LED_ON_LEVEL kTPM_LowTrue
	#endif
	#define BOARD_FIRST_TPM_CHANNEL 0U
	#define BOARD_SECOND_TPM_CHANNEL 1U

		tpmParam[0].chnlNumber = (tpm_chnl_t)BOARD_FIRST_TPM_CHANNEL;
		tpmParam[0].level = TPM_LED_ON_LEVEL;
		tpmParam[0].dutyCyclePercent = updatedDutycycle;

		tpmParam[1].chnlNumber = (tpm_chnl_t)BOARD_SECOND_TPM_CHANNEL;
		tpmParam[1].level = TPM_LED_ON_LEVEL;
		tpmParam[1].dutyCyclePercent = updatedDutycycle;

	#else
		#error "pwm num set err!"
	#endif

	/* Select the clock source for the TPM counter as kCLOCK_McgInternalRefClk */
	//    CLOCK_SetTpmClock(1U);
	CLOCK_SetTpmClock(3U);

	TPM_GetDefaultConfig(&tpmInfo);
	/* Initialize TPM module */
	TPM_Init(BOARD_TPM_BASEADDR, &tpmInfo);

	// redefine ch number by micro, set freq divider here
	// 25k freq deviation  50k bandwidth
	TPM_SetupPwm(BOARD_TPM_BASEADDR, &tpmParam, USER_PWM_NUM, kTPM_CenterAlignedPwm, 50000U, 2000000); //  2M clock source @VLPR
	TPM_StartTimer(BOARD_TPM_BASEADDR, kTPM_SystemClock);
}

void user_VLPR(smc_power_state_t *pcurPowerState, app_power_mode_t *ptargetPowerMode,  bool *pneedSetWakeup)
{
	*pcurPowerState = SMC_GetPowerModeState(SMC);

//        APP_ShowPowerMode(curPowerState);
//        user_showFreqList();

    // set default powermode as vlpr
    if(*pcurPowerState != kSMC_PowerStateVlpr)
    {
    	*ptargetPowerMode = (app_power_mode_t)kAPP_PowerModeVlpr;
    }
    else
    {
    	*ptargetPowerMode = (app_power_mode_t)kAPP_PowerModeVlpr;
    }
    // A:run, D:vlpr, I:vlls3
//        PRINTF("\r\nTarget %c \r\n", targetPowerMode);

	if ((*ptargetPowerMode > kAPP_PowerModeMin) && (*ptargetPowerMode < kAPP_PowerModeMax))
	{
		/* If could not set the target power mode, loop continue. */
		if (!APP_CheckPowerMode(*pcurPowerState, *ptargetPowerMode))
		{
//				PRINTF("\r\n curPowerState %x \r\n", curPowerState);
//				continue;
//				break;
		}

		/* If target mode is RUN/VLPR/HSRUN, don't need to set wakeup source. */
		if ((kAPP_PowerModeRun == *ptargetPowerMode) || (kAPP_PowerModeVlpr == *ptargetPowerMode))
		{
			*pneedSetWakeup = false;
		}
		else
		{
			*pneedSetWakeup = true;
		}

		if (*pneedSetWakeup)
		{
			APP_GetWakeupConfig(*ptargetPowerMode);
		}

		APP_PowerPreSwitchHook(*pcurPowerState, *ptargetPowerMode);

		if (*pneedSetWakeup)
		{
			APP_SetWakeupConfig(*ptargetPowerMode);
		}

		APP_PowerModeSwitch(*pcurPowerState, *ptargetPowerMode);
		APP_PowerPostSwitchHook(*pcurPowerState, *ptargetPowerMode);
	}

}

void user_gpioInit(void)
{
    gpio_pin_config_t config_output_L = {kGPIO_DigitalOutput, 0};
    gpio_pin_config_t config_output_H = {kGPIO_DigitalOutput, 1};
    gpio_pin_config_t config_input    = {kGPIO_DigitalInput, 0};

    /* Init output ENABLE GPIO. */
    // GPIOA
    GPIO_PinInit(GPIOA, 7U, &config_output_L);
    GPIO_PinInit(GPIOA, 5U, &config_output_L);

    // GPIOB
//    GPIO_PinInit(GPIOB, 3U, &config_output_L);
    GPIO_PinInit(GPIOB, 3U, &config_input);

}

void delay(void)
{
	__asm("NOP"); /* delay */
	__asm("NOP"); /* delay */
	__asm("NOP"); /* delay */
	__asm("NOP"); /* delay */
	__asm("NOP"); /* delay */
}

void delay_n(uint16_t time)
{
    volatile uint32_t i = 0;
    for (i = 0; i < time; ++i)
    {
    	delay();
    }
}

#define DEBUG_END
int main(void)
{
    smc_power_state_t curPowerState;
    app_power_mode_t targetPowerMode;
    bool needSetWakeup; /* Need to set wakeup. */
    lptmr_config_t lptmrConfig;

    /* Power related. */
    SMC_SetPowerModeProtection(SMC, kSMC_AllowPowerModeAll);
    if (kRCM_SourceWakeup & RCM_GetPreviousResetSources(RCM)) /* Wakeup from VLLS. */
    {
        PMC_ClearPeriphIOIsolationFlag(PMC);
        NVIC_ClearPendingIRQ(LLWU_IRQn);
    }

#ifndef DEBUG_END
    lpuart_config_t config;
    lpuart_transfer_t xfer;
    lpuart_transfer_t sendXfer;
    lpuart_transfer_t receiveXfer;
    size_t receivedBytes = 0U;
    uint32_t i;

    BOARD_InitPins();
    BOARD_BootClockRUN();
    CLOCK_SetLpuart0Clock(0x1U);

    // gpio init
    user_gpioInit();

    // timer init 1ms
    user_timerInit();


    /*
     * config.baudRate_Bps = 115200U;
     * config.parityMode = kLPUART_ParityDisabled;
     * config.stopBitCount = kLPUART_OneStopBit;
     * config.txFifoWatermark = 0;
     * config.rxFifoWatermark = 0;
     * config.enableTx = false;
     * config.enableRx = false;
     */
    LPUART_GetDefaultConfig(&config);
    config.baudRate_Bps = BOARD_DEBUG_UART_BAUDRATE;
    config.enableTx = true;
    config.enableRx = true;

    LPUART_Init(DEMO_LPUART, &config, DEMO_LPUART_CLK_FREQ);
    LPUART_TransferCreateHandle(DEMO_LPUART, &g_lpuartHandle, LPUART_UserCallback, NULL);
    LPUART_TransferStartRingBuffer(DEMO_LPUART, &g_lpuartHandle, g_rxRingBuffer, RX_RING_BUFFER_SIZE);


    NVIC_EnableIRQ(LLWU_IRQn);
    NVIC_EnableIRQ(APP_WAKEUP_BUTTON_IRQ);

    // enter vlpr
    user_VLPR(&curPowerState, &targetPowerMode,  &needSetWakeup);

    /* Send g_tipString out. */
    xfer.data = g_tipString;
    xfer.dataSize = sizeof(g_tipString) - 1;
    txOnGoing = true;
    LPUART_TransferSendNonBlocking(DEMO_LPUART, &g_lpuartHandle, &xfer);

