Belief997/lab-Micro_power_consumption_backscatter/SDK_2.3.1_MKL03Z32xxx4/boards/frdmkl03z/demo_apps/power_mode_switch/power_mode_switch.c
    /* Wait send finished */
    while (txOnGoing)
    {
    }


    user_showFreq();

    /* Start to echo. */
    sendXfer.data = g_txBuffer;
    sendXfer.dataSize = ECHO_BUFFER_SIZE;
    receiveXfer.data = g_rxBuffer;
    receiveXfer.dataSize = ECHO_BUFFER_SIZE;

    u8 uart_rx[32] = "\0";
    u8 cnt_rx = 0;
    u8 cnt_rx_last = 0;
    u8 cnt_uart_sample = 0;
    u32 cnt_overTime = 0;

    while (1)
    {
        /* If g_txBuffer is empty and g_rxBuffer is full, copy g_rxBuffer to g_txBuffer. */
        if ((!rxBufferEmpty) && (!txBufferFull))
        {
            memcpy(g_txBuffer, g_rxBuffer, ECHO_BUFFER_SIZE);
            rxBufferEmpty = true;
            txBufferFull = true;
        }

        /* If RX is idle and g_rxBuffer is empty, start to read data to g_rxBuffer. */
        if ((!rxOnGoing) && rxBufferEmpty)
        {
            rxOnGoing = true;
            LPUART_TransferReceiveNonBlocking(DEMO_LPUART, &g_lpuartHandle, &receiveXfer, &receivedBytes);
            if (ECHO_BUFFER_SIZE == receivedBytes)
            {
                rxBufferEmpty = false;
                rxOnGoing = false;
            }
//            memcpy(uart_rx + cnt_rx, g_rxBuffer, 1);
            uart_rx[cnt_rx] = g_rxBuffer[0];
            cnt_rx++;
        }

//        if(cnt_uart_sample ++ >= 100)
//        {
//
//        	if(cnt_rx == cnt_rx_last && cnt_rx != 0)
//            {
////        		if(cnt_rx % 6 == 0)
//        		if(cnt_rx >= 6)
//        		{
//        			memcpy(dataBuf, uart_rx, SENSOR_DATA_LEN);
//        			status_rec = REC_SUCCESS;
//        		}
//        		else
//        		{
//        			status_rec = REC_FAIL;
//        		}
//        		cnt_rx = 0;
//            }
//        	cnt_rx_last = cnt_rx;
//        }


        if(STATUS_WAIT_DATA == status)
        {

			if(cnt_rx == 6)
			{
				memcpy(dataBuf, uart_rx, SENSOR_DATA_LEN);
				status_rec = REC_SUCCESS;
				cnt_rx = 0;
				cnt_overTime = 0;
			}
			else if(cnt_rx > 6)
			{
				status_rec = REC_FAIL;
				cnt_rx = 0;
				cnt_overTime = 0;
			}
			else
			{
				cnt_overTime ++ ;
				status_rec = REC_WAIT;
				if(cnt_overTime > 50000) // 6s
				{
					status_rec = REC_FAIL;
					cnt_rx = 0;
					cnt_overTime = 0;
				}
			}
        }
        else
        {
        	cnt_rx = 0;
        	cnt_overTime = 0;
        }


        /* If TX is idle and g_txBuffer is full, start to send data. */
        if ((!txOnGoing) && txBufferFull)
        {
            txOnGoing = true;
            LPUART_TransferSendNonBlocking(DEMO_LPUART, &g_lpuartHandle, &sendXfer);
        }

        if(STATUS_WAIT_TRIG == status)
        {
        	// IDLE
        	GPIO_PinWrite(GPIOB, 3U, 0);

        	GPIO_PinWrite(GPIOA, 5U, 1);
        	delay_n(100); // 2ms
        	GPIO_PinWrite(GPIOA, 5U, 0);

//        	GPIO_PinWrite(GPIOA, 5U, 1);

        	status = STATUS_WAIT_DATA;
        	status_rec = REC_WAIT;
        }

        if(STATUS_WAIT_DATA == status)
        {
        	// IDLE
        	GPIO_PinWrite(GPIOB, 3U, 0);

        	if(REC_SUCCESS == status_rec)
        	{
        		GPIO_PinWrite(GPIOA, 5U, 1);

        		status = STATUS_WAIT_SEND;
				status_rec = REC_WAIT;
        	}
        	else if(REC_FAIL == status_rec)
        	{
        		GPIO_PinWrite(GPIOA, 5U, 1);

        		status = STATUS_WAIT_TRIG;
        		status_rec = REC_WAIT;
        	}
        	else
        	{
        		status = STATUS_WAIT_DATA;
        	}
        }

        if(STATUS_WAIT_SEND == status)
        {
        	if(SEND_SUCCESS == status_send)
        	{
        		status_send = SEND_WAIT;
        		status = STATUS_WAIT_TRIG;
        	}
        	else
        	{
        		status = STATUS_WAIT_SEND;
        	}

        }


    }


#endif


#ifdef DEBUG_END


/******************************************************************************/
    //
#define DEBUG_FSK
    BOARD_InitPins();
    user_gpioInit();

    BOARD_BootClockRUN();
    APP_InitDefaultDebugConsole();

    NVIC_EnableIRQ(LLWU_IRQn);

    if (kRCM_SourceWakeup & RCM_GetPreviousResetSources(RCM)) /* Wakeup from VLLS. */
    {
        PRINTF("\r\nMCU wakeup from VLLS modes...\r\n");
    }

// lptmr init
    user_timerInit();

 // enter vlpr
    user_VLPR(&curPowerState, &targetPowerMode,  &needSetWakeup);

    // debug: show state to check
//    {
//    	u32 freq;
//        curPowerState = SMC_GetPowerModeState(SMC);
//        freq = CLOCK_GetFreq(kCLOCK_CoreSysClk);
//        APP_ShowPowerMode(curPowerState);
//
//    	  user_showFreqList();
//    }

// pwm init
    user_pwmInit();

/******************************************************************************/


//    static u8 fskBuff[2*FSK_FRAME_LEN] = {0};

    u8 data[] = {1, 2, 3, 4, 5, 6};
    fskLen = user_fskFrame(fskBuff, sizeof(fskBuff), data, sizeof(data));

    // debug
//    user_showFreqList();

#if WAKEUP_ENABLE
#define SLEEP_CNT 990000
    	u32 debug_cnt = 0;
#endif

    	u8 last_io = 0;
        while (1)
        {
        	if(iovalue != last_io)
        	{
        		TPM_UpdateChnlEdgeLevelSelect(BOARD_TPM_BASEADDR, (tpm_chnl_t)BOARD_TPM_CHANNEL, iovalue);
        		last_io = iovalue;
        	}

#if WAKEUP_ENABLE
            // hold output for about xxx sec

			if(debug_cnt++ > SLEEP_CNT)
			{
				debug_cnt = 0;
				PRINTF("  SLEEP.. \r\n");
				break;
			}
			else if(debug_cnt++ == SLEEP_CNT/2)
			{
				PRINTF("  SLEEP half time pass... \r\n");
            }

#endif


        }

#if WAKEUP_ENABLE
    // enter vlls3 mode
    {
        curPowerState = kSMC_PowerStateVlpr;
        targetPowerMode = (app_power_mode_t)kAPP_PowerModeVlls3;
        //needSetWakeup = true;
        APP_GetWakeupConfig(targetPowerMode);
        APP_PowerPreSwitchHook(curPowerState, targetPowerMode);
        APP_SetWakeupConfig(targetPowerMode);
        APP_PowerModeSwitch(curPowerState, targetPowerMode);
        APP_PowerPostSwitchHook(curPowerState, targetPowerMode);
    }
#endif



#endif
    return 0;
}

